//-------------------------------------------------------------------
// 2025. STL 6월 10일                                       (14주 1일)
//-------------------------------------------------------------------
//
//-------------------------------------------------------------------
// Algorithm
// C++ 20
// 1. Range Library
// 2. Concept
// 3. Coroutine
// 4. module
// 3,4는 visual studio에서 제대로 돌아가지는 않음
// range library에서 확장을 했다.
// 1. [begien,end)
// 2. [begien, count)
// 3. [begin, pred)
// 4. [begin,...)
// 
// 기존 sort -> range::sort를 구현해놓음
//-------------------------------------------------------------------

#include<iostream>

int main() {

}